<?php
// 中邮小包挂号国家分区
return[
    '1' => "日本",
    '2' => "韩国,马来西亚,泰国,新加坡,印度,印度尼西亚 ",
    '3' => "奥地利,保加利亚,克罗地亚,斯洛伐克,匈牙利,澳大利亚,爱尔兰,波兰,比利时,德国,丹麦,芬兰,荷兰,捷克,挪威,葡萄牙,瑞典,瑞士,希腊,意大利,以色列 ",
    '4' => "土耳其,新西兰",
    '5' => "英国,阿曼,阿塞拜疆,爱沙尼亚,白俄罗斯,波黑,巴基斯坦,朝鲜,法国,菲律宾,哈萨克斯坦,吉尔吉斯斯坦,加拿大,卡塔尔,罗马尼亚,卢森堡,立陶宛,拉脱维亚,马耳他,蒙古,美国,斯里兰卡,斯洛文尼亚,塞浦路斯,沙特阿拉伯,塔吉克斯坦,土库曼斯坦,乌克兰,乌兹别克斯坦,西班牙,叙利亚,亚美尼亚,越南,巴勒斯坦 ",
    '6' => "南非",
    '7' => "阿根廷,巴西,墨西哥",
    '8' => "阿富汗,阿联酋,不丹,巴林,东帝汶,柬埔寨,科威特,黎巴嫩,老挝,缅甸,马尔代夫,孟加拉国,秘鲁,尼泊尔,文莱,约旦,伊朗,伊拉克,也门,智利",
    '9' => "安道尔,阿尔巴尼亚,冰岛,梵蒂冈,法罗群岛,格鲁吉亚,黑山,列支敦士登,摩尔多瓦,摩纳哥,马其顿,塞尔维亚,圣马力诺,直布罗陀",
    '10'=> "阿尔及利亚,安哥拉,埃及,埃塞俄比亚,阿松森岛,巴布亚新几内亚,巴布亚新几内亚,博茨瓦纳,布基纳法索,布隆迪,法属波利尼西亚,贝宁,巴拿马,赤道几内亚,多哥,厄瓜多尔,厄立特里亚,佛得角,斐济,古巴,冈比亚,关岛,刚果（布）,刚果（金）,哥伦比亚,津巴布韦,吉布提,基里巴斯,加纳,加纳利群岛,几内亚,几内亚比绍,加蓬,卡奔达,库克群岛,科科斯（基林）群岛,科摩罗,喀麦隆,肯尼亚,科特迪瓦,利比里亚,利比亚,留尼汪,莱索托,卢旺达,马达加斯加,密克罗尼西亚,密克罗尼西亚,马里,摩洛哥,毛里求斯,毛里塔尼亚,马拉维,北马里亚纳群岛,莫桑比克,马绍尔群岛,马约特,纽埃,瑙鲁,纳米比亚,南乔治亚岛和南桑德韦奇岛,尼日尔,尼日利亚,帕劳,皮特凯恩,诺福克岛,美国本土外小岛屿,苏丹,圣诞岛,圣多美和普林西比,圣多美和普林西比,圣赫勒拿,圣基茨和尼维斯,塞拉利昂,所罗门群岛,苏里南,索马里,美属萨摩亚,塞内加尔,塞舌尔,斯威士兰,汤加,托克劳,特里斯达库尼亚,突尼斯,坦桑尼亚,图瓦卢,乌干达,瓦利斯和富图纳,瓦努阿图,委内瑞拉,新喀里多尼亚,西撒哈拉,萨摩亚,英属印度洋领地,伊夫尼,约翰斯敦岛,亚速尔群岛和马德拉群岛,赞比亚,乍得,中非,赫德岛和麦克唐那岛,斯瓦尔巴岛和扬马延岛,法属南部领土,安圭拉,阿鲁巴,安提瓜和巴布达,巴巴多斯,波多黎各,巴哈马,巴拉圭,玻利维亚,伯利兹,百慕大,多米尼加,福克兰群岛（马尔维纳斯）,法属圭亚那,瓜德罗普,格陵兰,格林纳达,哥斯达黎加,圭亚那,海地,洪都拉斯,荷属安的列斯,开曼群岛,美属维尔京群岛,马提尼克,蒙特塞拉特,尼加拉瓜,萨尔瓦多,圣卢西亚,圣皮埃尔和密克隆,圣文森特和格林纳丁斯,特克斯和凯科斯群岛,特立尼达和多巴哥,危地马拉,乌拉圭,牙买加,英属维尔京群岛,扎伊尔,复活岛",
    '11'=> "俄罗斯",
];