<?php
/**
 * 订单配置文件
 *
 * Created by PhpStorm.
 * User: bianhaiwei
 * Date: 16/3/3
 * Time: 下午4:01
 */
return [
    //订单状态
    'status' => [
        'UNPAID' => '未付款',
        'PAID' => '已付款',
        'PREPARED' => '准备发货',
        'NEED' => '缺货',
        'PACKED' => '打包完成',
        'SHIPPED' => '发货完成',
        'COMPLETE' => '订单完成',
        'CANCEL' => '取消订单',
        'REVIEW' => '需审核',
    ],

    //售后状态
    'active' => [
        'NORMAL' => '正常',
        'VERIFY' => '验证中',
        'CHARGEBACK' => '客户CB',
        'STOP' => '暂停发货',
        'RESUME' => '恢复正常'
    ],

    //订单地址
    'address' => [
        '0' => '未验证',
        '1' => '已验证'
    ],

    //撤单原因
    'withdraw' => [
        '修改订单',
        '欠货重打印(7天以内禁止这样操作)',
        '缺货(通知客服决定是否联系)',
        '客户取消',
        '等确认情况(尽量别撤)',
        '物品被删',
        '亏本',
        'PP或速卖通审查(要通知客户)',
        '账户冻结',
        '无法运输'
    ],

    //退款原因
    'reason' => [
        '[没发货] 客户取消',
        '[没发货] 缺货中国仓',
        '[没发货] 亏本+物品被删',
        '[没发货] 付款审查/资金冻结',
        '[中国发] 物流问题',
        '[中国发] 没出国退回',
        '[中国发] 关税',
        '[海外仓] 缺货海外仓',
        '[海外仓] 物流问题',
        '质量问题(尺码色差不能用不满意)',
        '运输损坏',
        '发错货(中国仓)',
        '发错货(海外仓)',
        '广告错/SKU错/客户错',
        '漏配件'
    ],

    //退款类型
    'type' => [
        '全部退款',
        '部分退款'
    ],

    //退款方式
    'refund' => [
        'Paypal',
        '销售平台'
    ],

    //币种
    'currency' => [
        'USD',
        'GBP',
        'EUR',
        'NOK',
        'CAD',
        'AUD',
        'CHF',
        'SEK',
        'PLN',
        'RUB',
        'MXN',
        'DKK',
        'SAR',
        'TWD',
        'JPY',
        'HKD'
    ],

    //种类
    'shipping' => [
        'EXPRESS' => '快递',
        'PACKET' => '小包'
    ],

    //支付方式
    'payment' => ['GC', 'IDEAL', 'OC', 'PP', 'SOFORT'],

    //是否
    'whether' => [
        '0' => '否',
        '1' => '是'
    ],

    //发货状态
    'item_status' => [
        'NEW' => '未发货',
        'PACKED' => '准备发货',
        'SHIPPED' => '已发货'
    ],

    //是否有效
    'is_active' => [
        '0' => '无效',
        '1' => '有效'
    ],
];