<?php
return [
    //采购条目配置
    'purchaseItem' =>[
		//采购状态
		'status'=>['未处理','采购中','待检入库',' 部分入库','已入库','取消'],
		//价格审核状态
		'costExamineStatus'=>['采购价格未审核','采购价格不通过','采购价格审核通过'],
		//异常类型
		'active' => ['正常','报缺', '报等', '残次', '图货不一'],	
		//异常类型对应状态
		'active_status'=>[
		'1'=>[0=>'正常',1=>'预报缺',2=>'核实报缺'],
		'2'=>[0=>'正常',1=>'报等'], 
		'3'=>[0=>'正常',1=>'残次'],
		'4'=>[0=>'正常',1=>'图货不一'],
		]
	],
    //采购单配置
    'purchaseOrder' =>[
		//采购单状态
		'status'=>['未处理','开始采购','待检入库','部分入库','已完成','取消'],
		//采购单审核
		'examineStatus'=>['未审核','已审核','二次审核','审核不通过'],
		//是否打印
		'orderPrint'=>['未打印','已打印'],
		//付款方式
		'pay_type'=>['网上付款','银行付款','现金支付','其他方式'],
		//核销状态
		'write_off'=>['未核销','待核销','已核销'],
		//采购单结算状态
		'close_status'=>['未结算','已结算'],
	],

	
];