<?php
return [
    //采购条目配置
    'purchaseItem' =>[
		//采购类型
		'type'=>['订单','囤货'],
		//采购状态
		'status'=>['未处理','采购中','已对单','取消'],
		//入库状态 
		'storageStatus'=>['未入库','部分入库','全部入库'],
		//价格审核状态
		'costExamineStatus'=>['采购价格未审核','采购价格不通过','采购价格审核通过'],
		//所属平台
		'channels' => ['choies', 'aliexpress', 'amazon', 'ebay', 'wish', 'Lazada'],
		//异常类型
		'active' => ['正常','报缺', '报等', '残次', '图货不一'],	
		//异常类型对应状态
		'active_status'=>[
		'1'=>[0=>'正常',1=>'预报缺',2=>'核实报缺'],
		'2'=>[0=>'正常',1=>'报等'], 
		'3'=>[0=>'正常',1=>'残次'],
		'4'=>[0=>'正常',1=>'图货不一'],
		]
	],
    //采购单配置
    'purchaseOrder' =>[
		//采购单状态
		'status'=>['未处理','开始采购','已到货','已对单','取消'],
		//采购单审核
		'examineStatus'=>['未审核','不通过','审核通过'],
		//价格审核状态
		'costExamineStatus'=>['采购价格未审核','采购价格不通过','采购价格审核通过'],
		//采购单结算状态
		'close_status'=>['未结算','已结算'],
		// 采购单入库状态
		'storageStatus'=>['未入库','部分入库','全部入库'],
	],

	
];